openfoam/OpenFOAM-dev/tutorials/multiRegion/film/rivuletBox/system/box/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // front
    (     0  0  0.02)
    ( 0.125  0  0.02)
    ( 0.625  0  0.02)
    ( 0.750  0  0.02)
    (     0  1  0.02)
    ( 0.125  1  0.02)
    ( 0.625  1  0.02)
    ( 0.750  1  0.02)

    // back
    (     0  0  0)
    ( 0.125  0  0)
    ( 0.625  0  0)
    ( 0.750  0  0)
    (     0  1  0)
    ( 0.125  1  0)
    ( 0.625  1  0)
    ( 0.750  1  0)
);

blocks
(
    hex (0 1 9 8 4 5 13 12) (30 10 240) simpleGrading (1 1 1)
    hex (1 2 10 9 5 6 14 13) (120 10 240) simpleGrading (1 1 1)
    hex (2 3 11 10 6 7 15 14) (30 10 240) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (5 6 14 13)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
        );
    }

    sides
    {
        type patch;
        faces
        (
            (8 0 4 12)
            (15 7 3 11)
            (13 5 4 12)
            (15 7 6 14)
        );
    }

    film
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
        );
    }

    window
    {
        type wall;
        faces
        (
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
        );
    }
);


// ************************************************************************* //
